//while
//let i = 0;
//while(prompt('Хотите ли вы продолжить?(д/н)') == 'д'){
//    alert("Мы очень рады");
//    i++;
//}
//
//alert("Вы продолжали " + i  + " раз");

//---------------------------------------------------------------------
//while like for
//Инициализация итератора
//let i = 0;
//
////цикл с условием
//while(i <= 30){
//    console.log(i + " сообщение");
//
////действие с итератором после итерации
//    
//    i++;
//}
//

//---------------------------------------------------------------------
//for
//for(let i = 0; i <= 30; i++){
//   console.log(i + " сообщение"); 
//}

//---------------------------------------------------------------------
//for like while
//
//let p = 30;
//
//for(; p > 0;){
//	console.log(p-- + " патрон ушел из ствола");
//}

//let a = 2,
//	answ = '';
//
//do{
//	a += a;
//	console.log('a = ' + a);
//	answ = prompt('Продолжать?(да/нет)');
//}while(answ == 'да');