let names = ['Швецский', "Китайский", "Среднеазиатский", "Северный", "Водный", "Земляной", "Сьомакский"],
    from = ['Украинляндия', "Священная Земля", "Туманный Альбион", "Папская Земля", "Степляндия", "Павлоградия", "Швеция", "Сьомакия", "Солнечный Алексееград", "Город-река"],
    dragons = [],
    dragonCount = 0;

dragonCount = parseInt(prompt('Введите количество драконов'));

for(let i = 0; i < dragonCount; i++){
    dragons[i] = {};
    dragons[i].name = "Дракон " + names[Math.floor(Math.random() * names.length)];
    // from - откуда
    // heads - 1 -> 20
    // color - 7 радужных цветов
    // sex - пол дракона(м/ж)
    // age - возраст дракона от 100 до 3000
}

console.log(dragons);



