let arr1 = ["Киев", "Харьков", 
            ["Камянское", "Новомосковск", "Павлоград"], 
            "Одесса", "Днепр"],
    arr2 = new Array(5);

// console.dir(arr1);
// console.dir(arr2);


console.log(arr1[2][1] + arr1[1]);

arr1[6] = "Львов";

arr1[2][3] = ["Подгородное", "Самаровка", "Лас-Вегас"];

console.log(arr1[5]);

//Затолкать в зад массива
arr1.push("Сичеслав", "Кодак", "Польград");
//Вставить в голову массива
arr1.unshift("Киевская область");
//Забрать из конца массива
// let polgr = arr1.pop();
//Забрать из головы массива
// let kiev = arr1.shift();

console.dir(arr1);